#

#
# ----------------------------------------------------------
# macOS 自动化部署清单 (Homebrew Bundle)
# ----------------------------------------------------------
# 使用方法:
# 1. 打开终端 (Terminal)
# 2. 安装 Homebrew (如果未安装):
#    /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# 3. 安装 Mac App Store 命令行工具:
#    brew install mas
# 4. 进入此文件所在目录，运行:
#    brew bundle

# ==========================================
# ⚙️ 操作系统增强
# ==========================================
cask "bleachbit"        # BleachBit (磁盘清理)
cask "clash-verge-rev"  # Clash Verge Rev (网络代理)
cask "raycast"          # Raycast (效率神器)
cask "dozer"            # Dozer (任务栏图标管理)
cask "hyperswitch"      # Hyper Switch (任务切换工具)

# ==========================================
# 📁 软件&文件管理
# ==========================================
cask "appcleaner"       # AppCleaner (卸载清理工具)
cask "google-drive"     # Google Drive
cask "resilio-sync"     # Resilio Sync
cask "odrive"           # Odrive
cask "the-unarchiver"   # The Unarchiver (解压工具)
cask "free-download-manager" # Free Download Manager
cask "ipfs"             # IPFS Desktop

# ==========================================
# 🌴 日常使用
# ==========================================
cask "google-chrome"    # Google Chrome
cask "opera"            # Opera Browser
cask "obsidian"         # Obsidian (笔记)
cask "xmind"            # Xmind (思维导图)
# 快贴 (Kuaitie) - 手动下载: https://kuaitie.cloud/
mas "Xnip", id: 1221250572  # Xnip (滚动截屏 - App Store)
mas "白描", id: 1362026606  # 白描 (OCR - App Store)
cask "screen-studio"    # Screen Studio (丝滑录屏)
cask "vlc"              # VLC Media Player
cask "calibre"          # Calibre (电子书管理)
cask "eudic"            # 欧路词典
cask "pdfgear"          # PDFgear
mas "Friendly Streaming", id: 553245401 # Friendly Browser (隐形浏览器)
mas "Simple Recorder", id: 989175722    # 简洁录音机 (一键录音)
cask "wechat"           # 微信
cask "qqmusic"          # QQ音乐
cask "netease-cloud-music" # 网易云音乐

# ==========================================
# ⚔️ 生产工具
# ==========================================
cask "visual-studio-code" # VS Code
# 影刀 (YingDao) - 手动下载: https://www.yingdao.com/
cask "figma"            # Figma
cask "gimp"             # GIMP (图像处理)
cask "inkscape"         # Inkscape (矢量绘图)
# Caesium - 手动下载: https://saerasoft.com/caesium/
mas "CollageIt 3 Free", id: 414307504 # Collagelt (拼图 - App Store)
cask "handbrake"        # HandBrake (视频转码)