#
#
# ----------------------------------------------------------
# macOS Automated Deployment Checklist (Homebrew Bundle)
# ----------------------------------------------------------
# Usage:
# 1. Open Terminal
# 2. Install Homebrew (if not already installed):
#    /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# 3. Install Mac App Store command line tool:
#    brew install mas
# 4. Navigate to this directory and run:
#    brew bundle

# ==========================================
# ⚙️ OS Enhancements
# ==========================================
mas "Cleaner One Pro", id: 1133028347  # Disk cleaning tool.
# manual "dozer", link: https://github.com/Mortennn/Dozer  # Menu bar icon management tool that hides infrequently used icons.
# manual "hyperswitch", link: https://bahoom.com/hyperswitch  # Task switcher more flexible and accurate than macOS built-in switching.
cask "raycast"  # Launcher that requires some habit change, but becomes a productivity powerhouse once accustomed.
cask "clash-verge-rev"  # Proxy Client.

# ==========================================
# 📁 File & Software Management
# ==========================================
cask "appcleaner"  # Uninstaller and cleanup tool.
cask "google-drive"  # Cloud drive and sync tool.
cask "resilio-sync"  # P2P sync tool, no cloud storage.
cask "odrive"  # Unified cloud storage sync tool that connects to Google Drive/OneDrive/Dropbox, bypassing network and client restrictions.
cask "free-download-manager"  # Download manager tool.

# ==========================================
# 🌴 Daily Use
# ==========================================
cask "google-chrome"  # Browser.
cask "obsidian"  # Notes and personal library.
cask "kuaitie"  # Clipboard sync tool with mobile device support.
mas "Xnip", id: 1221250572  # Screenshot tool supporting scrolling capture, local highlighting, step annotation.
# manual "baimiao", link: https://baimiao.uzero.cn/  # Screenshot OCR tool with high accuracy for Chinese text recognition.
cask "screen-studio"  # Screen recording tool with mouse following and automatic camera zooming.
cask "vlc"  # Local multimedia player supporting a wide range of formats.
cask "calibre"  # E-book management tool.
cask "eudic"  # Dictionary software.
cask "wechat"  # Dominant Chinese IM.
cask "qqmusic"  # Rich music library.
cask "neteasemusic"  # Supplementary music library.
mas "Friendly Streaming", id: 553245401  # Invisible browser (borderless, shadowless - you can imagine what it's used for).

# ==========================================
# ⚔️ Production Tools
# ==========================================
cask "visual-studio-code"  # Popular IDE.
# manual "yingdao", link: https://www.yingdao.com/  # Extremely powerful automation workflow tool, like iPhone Shortcuts on computer but much more powerful.
cask "xmind"  # Mind Map.
cask "figma"  # UI Design.
cask "gimp"  # Lightweight image processing, free alternative to Photoshop. Complete basic features, fast startup, convenient for quick tasks like resizing. Can change tool shortcuts to Photoshop style.
cask "inkscape"  # Vector graphics tool, free alternative to Illustrator. Opens .ai files with good fidelity, sufficient for downloading assets and saving as images.
# manual "caesium", link: https://saerasoft.com/caesium/  # Image compression tool.
# manual "CollageIt 3 Free", link: https://www.collageitfree.com/  # Collage tool for quickly creating photo walls and mood boards. Free version has watermark.
cask "handbrake"  # Large video compression for easy transfer. Also converts videos from other formats to MP4.
